OpenFOAM/Demo-ODE/LES_co/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha 0
);

regions
(
    boxToCell 
    {
      boxes
	((0 0.15 0) (8 0.2 4)
	 (0 1.8 0) (8 1.85 4));
        fieldValues
        (
             volScalarFieldValue alpha 1
        );
    }

);


// ************************************************************************* //

